[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Configurations/DependencyInjection.cs:10:9
     public static IServiceCollection AddApiServices(this IServiceCollection services, IConfiguration configuration)
     {
         // Register Api layer services
-        services.AddControllers();
+        ;
 
         return services;

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Configurations/DependencyInjection.cs:17:9
 
     public static WebApplicationBuilder AddGlobalExceptionHandler(this WebApplicationBuilder builder)
     {
-        builder.Services.AddExceptionHandler<GlobalExceptionHandler>();
+        ;
         return builder;
     }
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.GetById_NonExistentId_ReturnsNotFound
