[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Configurations/SwaggerConfiguration.cs:9:9
 {
     public static WebApplicationBuilder ConfigureSwagger(this WebApplicationBuilder builder)
     {
-        builder.Services.AddEndpointsApiExplorer();
+        ;
         builder.Services.AddSwaggerGen(options =>
             {

[NoCoverage] String mutation
BakalauruiPSP_project/POS-System.Api/Configurations/SwaggerConfiguration.cs:12:68
         builder.Services.AddEndpointsApiExplorer();
         builder.Services.AddSwaggerGen(options =>
             {
-                options.SwaggerDoc("v1", new OpenApiInfo { Title = "My API", Version = "v1" });
+                options.SwaggerDoc("v1", new OpenApiInfo { Title = "", Version = "v1" });
                 options.UseDateOnlyTimeOnlyStringConverters();
                 // Add security definition

[NoCoverage] Statement mutation
BakalauruiPSP_project/POS-System.Api/Configurations/SwaggerConfiguration.cs:13:17
         builder.Services.AddSwaggerGen(options =>
             {
                 options.SwaggerDoc("v1", new OpenApiInfo { Title = "My API", Version = "v1" });
-                options.UseDateOnlyTimeOnlyStringConverters();
+                ;
                 // Add security definition
                 options.AddSecurityDefinition("Bearer", new OpenApiSecurityScheme

[NoCoverage] String mutation
BakalauruiPSP_project/POS-System.Api/Configurations/SwaggerConfiguration.cs:20:36
                     Name = "Authorization",
                     Type = SecuritySchemeType.ApiKey,
                     Scheme = "Bearer",
-                    BearerFormat = "JWT",
+                    BearerFormat = "",
                     In = ParameterLocation.Header,
                     Description = "Enter 'Bearer' followed by a space and your JWT token."
