[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Configurations/ValidatorConfiguration.cs:10:9
 {
     public static WebApplicationBuilder ConfigureValidators(this WebApplicationBuilder builder)
     {
-        ArgumentNullException.ThrowIfNull(builder, nameof(builder));
+        ;
 
         builder.Services

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Configurations/ValidatorConfiguration.cs:12:9
     {
         ArgumentNullException.ThrowIfNull(builder, nameof(builder));
 
-        builder.Services
-            .AddFluentValidationAutoValidation()
-            .AddFluentValidationClientsideAdapters()
-            .AddValidatorsFromAssemblyContaining<GiftCardRequest>()
-            .AddValidatorsFromAssemblyContaining<TaxRequest>()
-            .AddValidatorsFromAssemblyContaining<BusinessDetailsRequest>()
-            .AddValidatorsFromAssemblyContaining<ItemDiscountRequest>()
-            .AddValidatorsFromAssemblyContaining<CartItemRequest>()
-            .AddValidatorsFromAssemblyContaining<ProductRequest>()
-            .AddValidatorsFromAssemblyContaining<ProductModificationRequest>()
-            .AddValidatorsFromAssemblyContaining<ServiceRequest>()
-            .AddValidatorsFromAssemblyContaining<TimeSlotRequest>();
+        ;
 
         return builder;
