[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/AuthController.cs:16:9
         [AllowAnonymous]
         [HttpPost("api/employees/register")]
         public async Task<IActionResult> RegisterUserAsync([FromBody] UserRegisterRequest userRegisterRequest)
-        {
-            var response = await authService.RegisterUserAsync(userRegisterRequest);
-
-            return Ok(response);
-        }   
+        {}   
         
         [AllowAnonymous]
killedBy: POS_System.Integration.Tests.Controllers.EmployeeControllerTests.Delete_ExistingId_ReturnsOkAndSoftDeletesEmployee; POS_System.Integration.Tests.Controllers.EmployeeControllerTests.Update_ExistingId_ReturnsOkWithUpdatedEmployee; POS_System.Integration.Tests.Controllers.AuthControllerTests.Register_DuplicateUserName_ReturnsBadRequest

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/AuthController.cs:25:9
         [AllowAnonymous]
         [HttpPost("v1/auth/login")]
         public async Task<IActionResult> LoginUserAsync([FromBody] UserLoginRequest credentials)
-        {
-            var response = await authService.LoginUserAsync(credentials);
-
-            return Ok(response);
-        }
+        {}
 
         [AllowAnonymous]
killedBy: POS_System.Integration.Tests.Controllers.AuthControllerTests.Login_ValidCredentials_ReturnsOkWithJwtToken; POS_System.Integration.Tests.Controllers.AuthControllerTests.Login_InvalidPassword_ReturnsUnauthorized; POS_System.Integration.Tests.Controllers.AuthControllerTests.Login_NonExistentUser_ReturnsUnauthorized

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/AuthController.cs:34:9
         [AllowAnonymous]
         [HttpPost("forgot-password")]
         public async Task<IActionResult> ForgotPasswordAsync(ForgotPasswordRequest forgotPasswordRequest)
-        {
-            var response = await authService.ForgotPasswordAsync(forgotPasswordRequest);
-
-            return Ok(response);
-        }
+        {}
 
         [AllowAnonymous]
killedBy: POS_System.Integration.Tests.Controllers.AuthControllerTests.ForgotPassword_ValidEmail_ReturnsOkWithRecoveryResponse; POS_System.Integration.Tests.Controllers.AuthControllerTests.ForgotPassword_UnknownEmail_StillReturnsOk

[NoCoverage] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/AuthController.cs:43:9
         [AllowAnonymous]
         [HttpPost("reset-password")]
         public async Task<IActionResult> ResetPasswordAsync(ResetPasswordRequest resetPasswordRequest)
-        {
-            var response = await authService.ResetPasswordAsync(resetPasswordRequest);
-
-            return Ok(response);
-        }
+        {}
     }
 }
