[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartController.cs:14:9
 
         [HttpGet]
         public async Task<IActionResult> GetAll(CancellationToken cancellationToken, int pageNum = 0, int pageSize = 35)
-        {
-            var result = await _cartService.GetAllAsync(cancellationToken, pageNum, pageSize);
-            return Ok(result);
-        }
+        {}
 
         [HttpGet("{id:int}")]
killedBy: POS_System.Integration.Tests.Controllers.CartControllerTests.GetAll_PageSizeZero_ReturnsOkWithEmptyPage; POS_System.Integration.Tests.Controllers.CartControllerTests.GetAll_ValidRequest_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartController.cs:21:9
 
         [HttpGet("{id:int}")]
         public async Task<IActionResult> GetByID([FromRoute] int id, CancellationToken cancellationToken)
-        {
-            var cart = await _cartService.GetByIdAsync(id, cancellationToken);
-            return Ok(cart);
-        }
+        {}
 
         [HttpPost]
killedBy: POS_System.Integration.Tests.Controllers.CartControllerTests.GetById_ExistingId_ReturnsOkWithCart

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartController.cs:28:9
 
         [HttpPost]
         public async Task<IActionResult> Create([FromBody] CartRequest cartDto, CancellationToken cancellationToken)
-        {
-            var cart = await _cartService.CreateCartAsync(cartDto, cancellationToken);
-            return Ok(cart);
-        }
+        {}
 
         [HttpDelete("{id:int}")]
killedBy: POS_System.Integration.Tests.Controllers.CartControllerTests.Delete_ExistingId_ReturnsOk; POS_System.Integration.Tests.Controllers.CartControllerTests.Create_ValidRequest_ReturnsOkWithCart; POS_System.Integration.Tests.Controllers.CartControllerTests.Create_NullEmployeeVersionId_StillCreatesCart

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartController.cs:36:13
         [HttpDelete("{id:int}")]
         public async Task<IActionResult> Delete([FromRoute] int id, CancellationToken cancellationToken)
         {
-            await _cartService.DeleteCartAsync(id, cancellationToken);
+            ;
             return Ok();
         }
killedBy: POS_System.Integration.Tests.Controllers.CartControllerTests.Delete_ExistingId_ReturnsOk; POS_System.Integration.Tests.Controllers.CartControllerTests.Delete_NonExistentId_ReturnsInternalServerError

[NoCoverage] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartController.cs:43:9
         
         [HttpPatch("{id:int}/discount")]
         public async Task<IActionResult> ApplyDiscountToCart([FromRoute] int id, [FromBody] ApplyDiscountRequest discountRequest, CancellationToken cancellationToken)
-        {
-            var response = await _cartService.ApplyDiscountForCartAsync(id, discountRequest, cancellationToken);
-            
-            return Ok(response);
-        }
+        {}
 
         [HttpGet("{id:int}/discount")]

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartController.cs:51:9
 
         [HttpGet("{id:int}/discount")]
         public async Task<IActionResult> GetCartDiscountAsync([FromRoute] int id, CancellationToken cancellationToken)
-        {
-            var response = await _cartService.GetCartDiscountAsync(id, cancellationToken);
-
-            return Ok(response);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.CartControllerTests.GetCartDiscount_NoDiscountApplied_ReturnsNoContent; POS_System.Integration.Tests.Controllers.CartControllerTests.GetCartDiscount_NonExistentCart_ReturnsNoContent
