[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/BusinessDetailController.cs:15:9
         [HttpGet]
         [Authorize("BusinessDetailsRead")]
         public async Task<IActionResult> GetBusinessDetails(CancellationToken cancellationToken)
-        {
-            var businessDetailsDto = await _businessDetailService.GetBusinessDetailsAsync(cancellationToken);
-            return Ok(businessDetailsDto);
-        }
+        {}
 
         [HttpPost]
killedBy: POS_System.Integration.Tests.Controllers.BusinessDetailControllerTests.Get_AfterCreation_ReturnsOkWithDetails

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/BusinessDetailController.cs:23:9
         [HttpPost]
         [Authorize("BusinessDetailsWrite")]
         public async Task<IActionResult> CreateBusinessDetails([FromBody] BusinessDetailsRequest businessDetailsDto, CancellationToken cancellationToken)
-        {
-            var businessDetailsResponseDto = await _businessDetailService.CreateOrUpdateBusinessDetailsAsync(businessDetailsDto, cancellationToken);
-            return Ok(businessDetailsResponseDto);
-        }
+        {}
 
         [HttpPut]
killedBy: POS_System.Integration.Tests.Controllers.BusinessDetailControllerTests.Create_ValidRequest_ReturnsOkWithBusinessDetails

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/BusinessDetailController.cs:31:9
         [HttpPut]
         [Authorize("BusinessDetailsWrite")]
         public async Task<IActionResult> UpdateBusinessDetails([FromBody] BusinessDetailsRequest businessDetailsDto, CancellationToken cancellationToken)
-        {
-            var businessDetailsResponseDto = await _businessDetailService.CreateOrUpdateBusinessDetailsAsync(businessDetailsDto, cancellationToken);
-            return Ok(businessDetailsResponseDto);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.BusinessDetailControllerTests.Update_ValidRequest_ReturnsOkWithUpdatedDetails
