[NoCoverage] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartDiscountController.cs:13:9
     {
         [HttpPost]
         public async Task<IActionResult> CreateCartDiscount([FromBody] CartDiscountRequest cartDiscountDto, CancellationToken cancellationToken)
-        {
-            var createdCartDiscount = await _cartDiscountService.CreateCartDiscountAsync(cartDiscountDto, cancellationToken);
-            return Ok(createdCartDiscount);
-        }
+        {}
 
         [HttpGet("{id}")]

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartDiscountController.cs:20:9
 
         [HttpGet("{id}")]
         public async Task<IActionResult> GetCartDiscountById(string id, CancellationToken cancellationToken)
-        {
-            var cartDiscount = await _cartDiscountService.GetCartDiscountByIdAsync(id, cancellationToken);
-            return Ok(cartDiscount);
-        }
+        {}
 
         [HttpDelete("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.CartDiscountControllerTests.GetById_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.CartDiscountControllerTests.GetById_ExistingId_ReturnsOkWithCartDiscount

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartDiscountController.cs:28:13
         [HttpDelete("{id}")]
         public async Task<IActionResult> DeleteCartDiscountById(string id, CancellationToken cancellationToken)
         {
-            await _cartDiscountService.DeleteCartDiscountAsync(id, cancellationToken);
+            ;
             return Ok();
         }
killedBy: POS_System.Integration.Tests.Controllers.CartDiscountControllerTests.Delete_NonExistentId_ReturnsNotFound
