[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartItemController.cs:19:9
     [HttpGet]
     public async Task<IActionResult> GetAllCartItems([FromRoute] int cartid, CancellationToken cancellationToken, int pageNum = 0, int pageSize = 10)
     {
-        Console.WriteLine($"cartid: {cartid}");
+        ;
         var cartItems = await cartItemService.GetAllCartItemsAsync(cartid, cancellationToken, pageNum, pageSize);
 

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartItemController.cs:28:5
     [HttpGet("{id:int}")]
     [Authorize(Policy = "CartItemRead")]
     public async Task<IActionResult> GetCartItemByIdAndCartId([FromRoute] int cartid, [FromRoute] int id, CancellationToken cancellationToken)
-    {
-        var result = await cartItemService.GetCartItemByIdAndCartIdAsync(cartid, id, cancellationToken);
-
-        return Ok(result);
-    }
+    {}
 
     [HttpPost]
killedBy: POS_System.Integration.Tests.Controllers.CartItemControllerTests.GetById_NonExistentItem_ReturnsNotFound; POS_System.Integration.Tests.Controllers.CartItemControllerTests.GetById_ExistingItemInCart_ReturnsOkWithCartItem

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartItemController.cs:37:5
     [HttpPost]
     [Authorize(Policy = "CartItemWrite")]
     public async Task<IActionResult> CreateCartItem([FromBody] CartItemRequest CartItemRequest, CancellationToken cancellationToken)
-    {
-        var newcartItem = await cartItemService.CreateCartItemAsync(CartItemRequest, cancellationToken);
-        return Ok(newcartItem);
-    }
+    {}
 
     [HttpPut("{id:int}")]
killedBy: POS_System.Integration.Tests.Controllers.CartItemControllerTests.UnlinkFromProductModifications_ValidIds_ReturnsOk; POS_System.Integration.Tests.Controllers.CartItemControllerTests.LinkToProductModifications_ValidIds_ReturnsOk; POS_System.Integration.Tests.Controllers.CartItemControllerTests.Delete_ExistingItem_ReturnsNoContent

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartItemController.cs:45:5
     [HttpPut("{id:int}")]
     [Authorize(Policy = "CartItemWrite")]
     public async Task<IActionResult> UpdateCartItem([FromRoute] int cartid, [FromRoute] int id, [FromBody] CartItemRequest cartItemUpdateRequestDto, CancellationToken cancellationToken)
-    {
-        var updatedcartItem = await cartItemService.UpdateCartItemAsync(cartid, id, cartItemUpdateRequestDto, cancellationToken);
-
-        return Ok(updatedcartItem);
-    }
+    {}
 
     [HttpDelete("{id:int}")]
killedBy: POS_System.Integration.Tests.Controllers.CartItemControllerTests.Update_NonExistentItem_ReturnsNotFound; POS_System.Integration.Tests.Controllers.CartItemControllerTests.Update_ExistingItem_ReturnsOkWithUpdatedCartItem

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartItemController.cs:55:9
     [Authorize(Policy = "CartItemWrite")]
     public async Task<IActionResult> DeleteCartItem([FromRoute] int cartid, [FromRoute] int id, CancellationToken cancellationToken)
     {
-        await cartItemService.DeleteCartItemAsync(cartid, id, cancellationToken);
+        ;
 
         return NoContent();
killedBy: POS_System.Integration.Tests.Controllers.CartItemControllerTests.Delete_NonExistentItem_ReturnsNotFound

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartItemController.cs:64:9
     [Authorize(Policy = "CartItemWrite")]
     public async Task<IActionResult> LinkCartItemToProductModifications(int id, [FromBody] int[] productModificationIdList, CancellationToken cancellationToken)
     {
-        await cartItemService.LinkCartItemToProductModificationsAsync(id, productModificationIdList, cancellationToken);
+        ;
 
         return Ok();

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/CartItemController.cs:73:9
     [Authorize(Policy = "CartItemWrite")]
     public async Task<IActionResult> UnlinkCartItemFromProductModifications(int id, [FromBody] int[] productModificationIdList, CancellationToken cancellationToken)
     {
-        await cartItemService.UnlinkCartItemFromProductModificationsAsync(id, productModificationIdList, cancellationToken);
+        ;
 
         return Ok();
