[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:13:9
     {
         [HttpPost("cash")]
         public async Task<IActionResult> RegisterCashTransactionAsync([FromBody] CashRequest cashRequest, CancellationToken token)
-        {
-            var response = await paymentService.RegisterCashTransactionAsync(cashRequest, token);
-
-            return Ok(response);
-        }
+        {}
 
         [HttpPatch("refund/{id}")]
killedBy: POS_System.Integration.Tests.Controllers.PaymentControllerTests.RegisterCashTransaction_ValidRequest_ReturnsOkWithTransaction; POS_System.Integration.Tests.Controllers.PaymentControllerTests.RegisterCashTransaction_NonExistentCart_ReturnsNotFound; POS_System.Integration.Tests.Controllers.PaymentControllerTests.IssueRefund_CompletedCartCashTransaction_ReturnsOkWithRefund

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:21:9
 
         [HttpPatch("refund/{id}")]
         public async Task<IActionResult> IssueRefundAsync([FromRoute] DateTime id, [FromBody] RefundRequest refundRequest, CancellationToken token)
-        {
-            var response = await paymentService.IssueRefundAsync(id, refundRequest, token);
-
-            return Ok(response);
-        }
+        {}
 
         [HttpGet("{id:int}")]
killedBy: POS_System.Integration.Tests.Controllers.PaymentControllerTests.IssueRefund_NonExistentCart_ReturnsNotFound; POS_System.Integration.Tests.Controllers.PaymentControllerTests.IssueRefund_CompletedCartCashTransaction_ReturnsOkWithRefund

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:29:9
 
         [HttpGet("{id:int}")]
         public async Task<IActionResult> GetTransactionsByCartAsync([FromRoute] int id)
-        {
-            var response = await paymentService.GetTransactionsByCartAsync(id);
-
-            return Ok(response);
-        }
+        {}
 
         [HttpPost("full-checkout")]
killedBy: POS_System.Integration.Tests.Controllers.PaymentControllerTests.GetTransactionsByCart_CartWithNoTransactions_ReturnsOkWithEmptyList; POS_System.Integration.Tests.Controllers.PaymentControllerTests.GetTransactionsByCart_CartWithTransactions_ReturnsOkWithList

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:37:9
 
         [HttpPost("full-checkout")]
         public async Task<IActionResult> FullCheckoutAsync([FromBody] CheckoutRequest checkoutRequest, CancellationToken token = default)
-        {
-            var response = await paymentService.FullCheckoutAsync(checkoutRequest, token);
-
-            return Ok(response);
-        }
+        {}
 
         [HttpPost("init-partial-checkout")]
killedBy: POS_System.Integration.Tests.Controllers.PaymentControllerTests.FullCheckout_CartNotInProgress_ReturnsBadRequest; POS_System.Integration.Tests.Controllers.PaymentControllerTests.FullCheckout_NonExistentCart_ReturnsNotFound

[NoCoverage] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:45:9
 
         [HttpPost("init-partial-checkout")]
         public async Task<IActionResult> InitializePartialCheckoutAsync([FromBody] InitPartialCheckoutRequest checkoutRequest, CancellationToken token = default)
-        {
-            var response = await paymentService.InitializePartialCheckoutAsync(checkoutRequest, token);
-
-            return Ok(response);
-        }
+        {}
 
         [HttpPost("partial-checkout")]

[NoCoverage] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:53:9
 
         [HttpPost("partial-checkout")]
         public async Task<IActionResult> PartialCheckoutAsync([FromBody] PartialCheckoutRequest checkoutRequest, CancellationToken token = default)
-        {
-            var response = await paymentService.PartialCheckoutAsync(checkoutRequest, token);
-
-            return Ok(response);
-        }
+        {}
 
         [HttpGet("full-checkout-success")]

[NoCoverage] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:61:9
 
         [HttpGet("full-checkout-success")]
         public async Task<IActionResult> FullCheckoutSuccessAsync([FromQuery] DateTime transactionDate, [FromQuery] int cartId, [FromQuery] string sessionId, [FromQuery] string? phoneNumber)
-        {
-            var path = await paymentService.FullCheckoutSuccessAsync(transactionDate, sessionId, cartId, phoneNumber);
-
-            return Redirect(path);
-        }
+        {}
 
         [HttpGet("partial-checkout-success")]

[NoCoverage] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:69:9
 
         [HttpGet("partial-checkout-success")]
         public async Task<IActionResult> PartialCheckoutSuccessAsync([FromQuery] DateTime transactionDate, [FromQuery] int cartId, [FromQuery] string sessionId, [FromQuery] string? phoneNumber)
-        {
-            var path = await paymentService.PartialCheckoutSuccessAsync(transactionDate, sessionId, cartId, phoneNumber);
-
-            return Redirect(path);
-        }
+        {}
 
         [HttpGet("checkout-fail")]

[NoCoverage] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/PaymentController.cs:77:9
 
         [HttpGet("checkout-fail")]
-        {
-            var path = await paymentService.CheckoutFailAsync(transactionDate, sessionId, cartId, giftCardCode, discount);
-
-            return Redirect(path);
-        }
+        {}
     }
 }
