[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/EmployeeController.cs:15:9
         [Authorize("EmployeesRead")]
         [HttpGet]
         public async Task<IActionResult> GetEmployeesAsync([FromQuery] bool? onlyActive, CancellationToken cancellationToken, [FromQuery] int pageNumber = 0, [FromQuery] int pageSize = 10)
-        {
-            var result = await employeeeService.GetEmployeesAsync(pageSize, pageNumber, onlyActive, cancellationToken);
-
-            return Ok(result);
-        }
+        {}
 
         [Authorize("EmployeesRead")]
killedBy: POS_System.Integration.Tests.Controllers.EmployeeControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/EmployeeController.cs:24:9
         [Authorize("EmployeesRead")]
         [HttpGet("{id:int}")]
         public async Task<IActionResult> GetEmployeeByIdAsync([FromRoute] int id, CancellationToken cancellationToken)
-        {
-            var result = await employeeeService.GetEmployeeByIdAsync(id, cancellationToken);
-
-            return Ok(result);
-        }
+        {}
 
         [Authorize("EmployeesWrite")]
killedBy: POS_System.Integration.Tests.Controllers.EmployeeControllerTests.GetById_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.EmployeeControllerTests.GetById_ExistingId_ReturnsOkWithEmployee

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/EmployeeController.cs:33:9
         [Authorize("EmployeesWrite")]
         [HttpPut("{employeeId:int}")]
         public async Task<IActionResult> UpdateEmployeeByIdAsync([FromRoute] int employeeId, [FromBody] EmployeeRequest employeeRequest, CancellationToken cancellationToken)
-        {
-            var result = await employeeeService.UpdateEmployeeByIdAsync(employeeId, employeeRequest, cancellationToken);
-
-            return Ok(result);
-        }
+        {}
 
         [Authorize("EmployeesWrite")]
killedBy: POS_System.Integration.Tests.Controllers.EmployeeControllerTests.Update_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.EmployeeControllerTests.Update_ExistingId_ReturnsOkWithUpdatedEmployee

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/EmployeeController.cs:42:9
         [Authorize("EmployeesWrite")]
         [HttpDelete("{employeeId:int}")]
         public async Task<IActionResult> DeleteEmployeeByIdAsync([FromRoute] int employeeId, CancellationToken cancellationToken)
-        {
-            var result = await employeeeService.DeleteEmployeeByIdAsync(employeeId, cancellationToken);
-
-            return Ok(result);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.EmployeeControllerTests.Delete_ExistingId_ReturnsOkAndSoftDeletesEmployee; POS_System.Integration.Tests.Controllers.EmployeeControllerTests.Delete_NonExistentId_ReturnsNotFound
