[Killed] Object initializer mutation
BakalauruiPSP_project/POS-System.Api/ExceptionHandler/GlobalExceptionHandler.cs:17:15
     {
         var problemDetails = exception is BaseException baseException
             ? baseException.GetErrorDetails()
-            : new ErrorDetails
-            {
-                Status = StatusCodes.Status500InternalServerError,
-                Title = "An unexpected error occurred.",
-                Details = exception.Message
-            };
+            : new ErrorDetails
+{};
 
         httpContext.Response.StatusCode = problemDetails.Status;
killedBy: POS_System.Integration.Tests.Controllers.CartControllerTests.Delete_NonExistentId_ReturnsInternalServerError; POS_System.Integration.Tests.Controllers.CartControllerTests.GetById_NonExistentId_ReturnsInternalServerError

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/ExceptionHandler/GlobalExceptionHandler.cs:25:9
             };
 
         httpContext.Response.StatusCode = problemDetails.Status;
-        httpContext.Response.Headers.Append(HeaderNames.ContentType, MediaTypeNames.Application.Json);
+        ;
 
         var jsonOptions = new JsonSerializerOptions

[Timeout] Statement mutation
BakalauruiPSP_project/POS-System.Api/ExceptionHandler/GlobalExceptionHandler.cs:33:9
             PropertyNamingPolicy = JsonNamingPolicy.CamelCase
         };
 
-        await httpContext.Response.WriteAsJsonAsync(problemDetails, jsonOptions, cancellationToken);
+        ;
 
         return true;
