[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/GiftCardController.cs:16:5
     [Authorize(Policy = "GiftCardRead")]
     [HttpGet]
     public async Task<IActionResult> GetAllGiftCards(CancellationToken cancellationToken, int pageNum = 0, int pageSize = 10)
-    {
-        var giftCards = await giftCardService.GetAllGiftCardsAsync(cancellationToken, pageNum, pageSize);
-
-        return Ok(giftCards);
-    }
+    {}
 
     [HttpGet("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/GiftCardController.cs:25:5
     [HttpGet("{id}")]
     [Authorize(Policy = "GiftCardRead")]
     public async Task<IActionResult> GetGiftCardById([FromRoute] string id, CancellationToken cancellationToken)
-    {
-        var result = await giftCardService.GetGiftCardByIdAsync(id, cancellationToken);
-
-        return Ok(result);
-    }
+    {}
 
     [HttpPost]
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.GetById_ExistingId_ReturnsOkWithGiftCard; POS_System.Integration.Tests.Controllers.GiftCardControllerTests.GetById_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/GiftCardController.cs:34:5
     [HttpPost]
     [Authorize(Policy = "GiftCardWrite")]
     public async Task<IActionResult> CreateGiftCard([FromBody] GiftCardRequest GiftCardRequest, CancellationToken cancellationToken)
-    {
-        var newGiftCard = await giftCardService.CreateGiftCardAsync(GiftCardRequest, cancellationToken);
-        return Ok(newGiftCard);
-    }
+    {}
 
     [HttpPut("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.GetById_ExistingId_ReturnsOkWithGiftCard; POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Update_ExistingId_ReturnsOkWithUpdatedGiftCard; POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Delete_ExistingId_ReturnsNoContentAndRemovesCard

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/GiftCardController.cs:42:5
     [HttpPut("{id}")]
     [Authorize(Policy = "GiftCardWrite")]
     public async Task<IActionResult> UpdateGiftCard([FromRoute] string id, [FromBody] GiftCardRequest giftCardUpdateRequestDto, CancellationToken cancellationToken)
-    {
-        var updatedGiftCard = await giftCardService.UpdateGiftCardAsync(id, giftCardUpdateRequestDto, cancellationToken);
-
-        return Ok(updatedGiftCard);
-    }
+    {}
 
     [HttpDelete("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Update_ExistingId_ReturnsOkWithUpdatedGiftCard; POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Update_NonExistentId_ReturnsNotFound

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/GiftCardController.cs:52:9
     [Authorize(Policy = "GiftCardWrite")]
     public async Task<IActionResult> DeleteGiftCard([FromRoute] string id, CancellationToken cancellationToken)
     {
-        await giftCardService.DeleteGiftCardAsync(id, cancellationToken);
+        ;
 
         return NoContent();
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Delete_ExistingId_ReturnsNoContentAndRemovesCard; POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Delete_NonExistentId_ReturnsNotFound
