[Survived] Null coalescing mutation (remove right)
BakalauruiPSP_project/POS-System.Api/Middleware/RequestLoggingMiddleware.cs:11:17
 
     public RequestLoggingMiddleware(RequestDelegate next, ILogger<ApplicationLogger> logger)
     {
-        _next = next ?? throw new ArgumentNullException(nameof(next));
+        _next = next;
         _logger = logger ?? throw new ArgumentNullException(nameof(logger));
     }

[Survived] Null coalescing mutation (remove right)
BakalauruiPSP_project/POS-System.Api/Middleware/RequestLoggingMiddleware.cs:12:19
     public RequestLoggingMiddleware(RequestDelegate next, ILogger<ApplicationLogger> logger)
     {
         _next = next ?? throw new ArgumentNullException(nameof(next));
-        _logger = logger ?? throw new ArgumentNullException(nameof(logger));
+        _logger = logger;
     }
 

[Survived] Equality mutation
BakalauruiPSP_project/POS-System.Api/Middleware/RequestLoggingMiddleware.cs:17:13
 
     public async Task InvokeAsync(HttpContext context)
     {
-        if (context.Request.ContentLength > 0)
+        if (context.Request.ContentLength < 0)
         {
             context.Request.EnableBuffering();

[Survived] Equality mutation
BakalauruiPSP_project/POS-System.Api/Middleware/RequestLoggingMiddleware.cs:17:13
 
     public async Task InvokeAsync(HttpContext context)
     {
-        if (context.Request.ContentLength > 0)
+        if (context.Request.ContentLength >= 0)
         {
             context.Request.EnableBuffering();

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Middleware/RequestLoggingMiddleware.cs:19:13
     {
         if (context.Request.ContentLength > 0)
         {
-            context.Request.EnableBuffering();
+            ;
             var requestBody = await ReadRequestBody(context.Request);
 
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.Create_MissingToken_ReturnsUnauthorized; POS_System.Integration.Tests.Controllers.TaxControllerTests.Delete_ExistingId_ReturnsOkAndMarksTaxDeleted

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Middleware/RequestLoggingMiddleware.cs:22:13
             context.Request.EnableBuffering();
             var requestBody = await ReadRequestBody(context.Request);
 
-            _logger.Log(LogLevel.Information, $"Request {context.Request.Method} {context.Request.Path}: {requestBody}");
+            ;
 
             context.Request.Body.Position = 0;

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Middleware/RequestLoggingMiddleware.cs:27:9
             context.Request.Body.Position = 0;
         }
 
-        await _next(context);
+        ;
     }
 
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.Create_MissingToken_ReturnsUnauthorized; POS_System.Integration.Tests.Controllers.TaxControllerTests.Delete_ExistingId_ReturnsOkAndMarksTaxDeleted

[Killed] Boolean mutation
BakalauruiPSP_project/POS-System.Api/Middleware/RequestLoggingMiddleware.cs:32:85
 
     private async Task<string> ReadRequestBody(HttpRequest request)
     {
-        using var reader = new StreamReader(request.Body, Encoding.UTF8, leaveOpen: true);
+        using var reader = new StreamReader(request.Body, Encoding.UTF8, leaveOpen: false);
         string body = await reader.ReadToEndAsync();
         return body;
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.Create_MissingToken_ReturnsUnauthorized; POS_System.Integration.Tests.Controllers.TaxControllerTests.Delete_ExistingId_ReturnsOkAndMarksTaxDeleted; POS_System.Integration.Tests.Controllers.TaxControllerTests.Update_ExistingId_ReturnsOkWithUpdatedTax
