[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ItemDiscountController.cs:15:9
         [HttpGet]
         [Authorize("ItemDiscountRead")]
         public async Task<IActionResult> GetAllItemDiscounts(CancellationToken cancellationToken, int pageNum = 0, int pageSize = 35)
-        {
-            var itemDiscounts = await _itemDiscountService.GetAllItemDiscountsAsync(cancellationToken, pageNum, pageSize);
-            return Ok(itemDiscounts);
-        }
+        {}
 
         [HttpPost]
killedBy: POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ItemDiscountController.cs:23:9
         [HttpPost]
         [Authorize("ItemDiscountWrite")]
         public async Task<IActionResult> CreateItemDiscount([FromBody] ItemDiscountRequest itemDiscountDto, CancellationToken cancellationToken)
-        {
-            var createdItemDiscount = await _itemDiscountService.CreateItemDiscountAsync(itemDiscountDto, cancellationToken);
-            return Ok(createdItemDiscount);
-        }
+        {}
 
         [HttpGet("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.Update_ExistingId_ReturnsOkWithUpdatedItemDiscount; POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.UnlinkFromProducts_ValidIds_ReturnsOk; POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.Create_ValidRequest_ReturnsOkWithCreatedItemDiscount

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ItemDiscountController.cs:31:9
         [HttpGet("{id}")]
         [Authorize("ItemDiscountRead")]
         public async Task<IActionResult> GetItemDiscountById(int id, CancellationToken cancellationToken)
-        {
-            var itemDiscount = await _itemDiscountService.GetItemDiscountByIdAsync(id, cancellationToken);
-            return Ok(itemDiscount);
-        }
+        {}
 
         [HttpDelete("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.GetById_ExistingId_ReturnsOkWithItemDiscount; POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.GetById_NonExistentId_ReturnsNotFound

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ItemDiscountController.cs:40:13
         [Authorize("ItemDiscountWrite")]
         public async Task<IActionResult> DeleteItemDiscountById(int id, CancellationToken cancellationToken)
         {
-            await _itemDiscountService.DeleteItemDiscountAsync(id, cancellationToken);
+            ;
             return Ok();
         }
killedBy: POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.Delete_ExistingId_ReturnsOkAndSoftDeletesDiscount; POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.Delete_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ItemDiscountController.cs:47:9
         [HttpPut("{id}")]
         [Authorize("ItemDiscountWrite")]
         public async Task<IActionResult> UpdateItemDiscountById(int id, [FromBody] ItemDiscountRequest itemDiscountDto, CancellationToken cancellationToken)
-        {
-            var updatedItemDiscount = await _itemDiscountService.UpdateItemDiscountAsync(id, itemDiscountDto, cancellationToken);
-            return Ok(updatedItemDiscount);
-        }
+        {}
 
         [HttpPut("{id}/link")]
killedBy: POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.Update_ExistingId_ReturnsOkWithUpdatedItemDiscount; POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.Update_NonExistentId_ReturnsNotFound

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ItemDiscountController.cs:56:13
         [Authorize("ItemDiscountWrite")]
         public async Task<IActionResult> LinkItemDiscountToItems(int id, [FromQuery] bool itemsAreProducts, [FromBody] int[] itemIdList, CancellationToken cancellationToken)
         {
-            await _itemDiscountService.LinkItemDiscountToItemsAsync(id, itemsAreProducts, itemIdList, cancellationToken);
+            ;
 
             return Ok();

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ItemDiscountController.cs:65:13
         [Authorize("ItemDiscountWrite")]
         public async Task<IActionResult> UnlinkItemDiscountFromItems(int id, [FromQuery] bool itemsAreProducts, [FromBody] int[] itemIdList, CancellationToken cancellationToken)
         {
-            await _itemDiscountService.UnlinkItemDiscountFromItemsAsync(id, itemsAreProducts, itemIdList, cancellationToken);
+            ;
 
             return Ok();

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ItemDiscountController.cs:74:9
         [HttpGet("item/{id}")]
         [Authorize("ItemDiscountRead")]
         public async Task<IActionResult> GetItemDiscountsLinkedToItemId(int id, [FromQuery] bool isProduct, [FromQuery] DateTime? timeStamp, CancellationToken cancellationToken)
-        {
-            var itemDiscounts = await _itemDiscountService.GetItemDiscountsLinkedToItemId(id, isProduct, timeStamp, cancellationToken);
-            return Ok(itemDiscounts);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.ItemDiscountControllerTests.GetItemDiscountsLinkedToItemId_ValidProductId_ReturnsOkWithList
