[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductController.cs:16:9
         [Authorize("ItemRead")]
         [HttpGet]
         public async Task<IActionResult> GetAllProducts([FromQuery] bool? onlyActive, CancellationToken cancellationToken, [FromQuery] int pageSize = 10, [FromQuery] int pageNumber = 0)
-        {
-            var products = await _productService.GetProductsAsync(pageSize, pageNumber, onlyActive, cancellationToken);
-            return Ok(products);
-        }
+        {}
 
         [Authorize("ItemRead")]
killedBy: POS_System.Integration.Tests.Controllers.ProductControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductController.cs:24:9
         [Authorize("ItemRead")]
         [HttpGet("{id}")]
         public async Task<IActionResult> GetProductById(int id, CancellationToken cancellationToken)
-        {
-            var products = await _productService.GetProductByIdAsync(id, cancellationToken);
-            return Ok(products);
-        }
+        {}
 
         [Authorize("ItemRead")]
killedBy: POS_System.Integration.Tests.Controllers.ProductControllerTests.GetById_ExistingId_ReturnsOkWithProduct; POS_System.Integration.Tests.Controllers.ProductControllerTests.GetById_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductController.cs:32:9
         [Authorize("ItemRead")]
         [HttpGet("{productId}/versions/")]
         public async Task<IActionResult> GetProductVersionsByProductId(int productId, CancellationToken cancellationToken)
-        {
-            var products = await _productService.GetProductVersionsByProductIdAsync(productId, cancellationToken);
-            return Ok(products);
-        }
+        {}
 
         [Authorize("ItemWrite")]
killedBy: POS_System.Integration.Tests.Controllers.ProductControllerTests.GetVersionsByProductId_ExistingProductId_ReturnsVersionList

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductController.cs:40:9
         [Authorize("ItemWrite")]
         [HttpPost]
         public async Task<IActionResult> CreateProduct([FromBody] ProductRequest? productDto, CancellationToken cancellationToken)
-        {
-            var product = await _productService.CreateProductAsync(productDto, cancellationToken);
-            return Ok(product);
-        }
+        {}
 
         [Authorize("ItemWrite")]
killedBy: POS_System.Integration.Tests.Controllers.ProductControllerTests.Create_ValidRequest_ReturnsOkWithCreatedProduct; POS_System.Integration.Tests.Controllers.ProductControllerTests.Update_ExistingId_ReturnsOkWithUpdatedProduct; POS_System.Integration.Tests.Controllers.ProductControllerTests.Delete_ExistingId_ReturnsOkWithSoftDeletedProduct

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductController.cs:48:9
         [Authorize("ItemWrite")]
         [HttpPut("{id}")]
         public async Task<IActionResult> UpdateProductByProductId(int id, [FromBody] ProductRequest? productDto, CancellationToken cancellationToken)
-        {
-            var product = await _productService.UpdateProductByIdAsync(id, productDto, cancellationToken);
-            return Ok(product);
-        }
+        {}
 
         [HttpDelete("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.ProductControllerTests.Update_ExistingId_ReturnsOkWithUpdatedProduct; POS_System.Integration.Tests.Controllers.ProductControllerTests.Update_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductController.cs:56:9
         [HttpDelete("{id}")]
         [Authorize("ItemWrite")]
         public async Task<IActionResult> DeleteProductById(int id, CancellationToken cancellationToken)
-        {
-            var product = await _productService.DeleteProductByIdAsync(id, cancellationToken);
-            return Ok(product);
-        }
+        {}
 
         //Leave timeStamp null if you want to get only the active items
killedBy: POS_System.Integration.Tests.Controllers.ProductControllerTests.Delete_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.ProductControllerTests.Delete_ExistingId_ReturnsOkWithSoftDeletedProduct

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductController.cs:65:9
         [HttpGet("tax/{id}")]
         [Authorize(Policy = "ItemRead")]
         public async Task<IActionResult> GetProductsLinkedToTaxId(int id, [FromQuery] DateTime? timeStamp, CancellationToken cancellationToken)
-        {
-            var products = await _productService.GetProductsLinkedToTaxId(id, timeStamp, cancellationToken);
-            return Ok(products);
-        }
+        {}
 
         //Leave timeStamp null if you want to get only the active items
killedBy: POS_System.Integration.Tests.Controllers.ProductControllerTests.GetProductsLinkedToTaxId_ValidTaxId_ReturnsOkWithList

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductController.cs:74:9
         [HttpGet("item-discount/{id}")]
         [Authorize(Policy = "ItemRead")]
         public async Task<IActionResult> GetProductsLinkedToItemDiscountId(int id, [FromQuery] DateTime? timeStamp, CancellationToken cancellationToken)
-        {
-            var products = await _productService.GetProductsLinkedToItemDiscountId(id, timeStamp, cancellationToken);
-            return Ok(products);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.ProductControllerTests.GetProductsLinkedToItemDiscountId_ValidId_ReturnsOkWithList
