[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductModificationController.cs:16:9
         [Authorize("ItemRead")]
         [HttpGet]
         public async Task<IActionResult> GetAllProductModifications([FromQuery] bool? onlyActive, CancellationToken cancellationToken, [FromQuery] int pageSize = 10, [FromQuery] int pageNumber = 0)
-        {
-            var productModifications = await _productModificationService.GetProductModificationsAsync(pageSize, pageNumber, onlyActive, cancellationToken);
-            return Ok(productModifications);
-        }
+        {}
 
         [Authorize("ItemRead")]
killedBy: POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductModificationController.cs:24:9
         [Authorize("ItemRead")]
         [HttpGet("{id}")]
         public async Task<IActionResult> GetProductModificationById(int id, CancellationToken cancellationToken)
-        {
-            var productModifications = await _productModificationService.GetProductModificationByIdAsync(id, cancellationToken);
-            return Ok(productModifications);
-        }
+        {}
 
         [Authorize("ItemRead")]
killedBy: POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.GetById_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.GetById_ExistingId_ReturnsOkWithModification

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductModificationController.cs:32:9
         [Authorize("ItemRead")]
         [HttpGet("{productModificationtId}/versions/")]
         public async Task<IActionResult> GetProductModificationVersionsByProductModificationId(int productModificationtId, CancellationToken cancellationToken)
-        {
-            var productModifications = await _productModificationService.GetProductModificationVersionsByProductModificationIdAsync(productModificationtId, cancellationToken);
-            return Ok(productModifications);
-        }
+        {}
 
         [Authorize("ItemWrite")]
killedBy: POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.GetVersionsByModificationId_ExistingProductModificationId_ReturnsVersionList

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductModificationController.cs:40:9
         [Authorize("ItemWrite")]
         [HttpPost]
         public async Task<IActionResult> CreateProductModification([FromBody] ProductModificationRequest? productModificationDto, CancellationToken cancellationToken)
-        {
-            var productModification = await _productModificationService.CreateProductModificationAsync(productModificationDto, cancellationToken);
-            return Ok(productModification);
-        }
+        {}
 
         [Authorize("ItemWrite")]
killedBy: POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.Create_ValidRequest_ReturnsOkWithCreatedModification; POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.Update_ExistingId_ReturnsOkWithUpdatedModification; POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.Delete_ExistingId_ReturnsOkWithSoftDeletedModification

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductModificationController.cs:48:9
         [Authorize("ItemWrite")]
         [HttpPut("{id}")]
         public async Task<IActionResult> UpdateProductModification(int id, [FromBody] ProductModificationRequest? productModificationDto, CancellationToken cancellationToken)
-        {
-            var productModification = await _productModificationService.UpdateProductModificationByIdAsync(id, productModificationDto, cancellationToken);
-            return Ok(productModification);
-        }
+        {}
 
         [Authorize("ItemWrite")]
killedBy: POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.Update_ExistingId_ReturnsOkWithUpdatedModification; POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.Update_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductModificationController.cs:56:9
         [Authorize("ItemWrite")]
         [HttpDelete("{id}")]
         public async Task<IActionResult> DeleteProductModification(int id, CancellationToken cancellationToken)
-        {
-            var productModification = await _productModificationService.DeleteProductModificationByIdAsync(id, cancellationToken);
-            return Ok(productModification);
-        }
+        {}
 
         //Leave timeStamp null if you want to get only the active items
killedBy: POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.Delete_ExistingId_ReturnsOkWithSoftDeletedModification; POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.Delete_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductModificationController.cs:65:9
         [HttpGet("cart-item/{id}")]
         [Authorize(Policy = "ItemRead")]
         public async Task<IActionResult> GetProductModificationsLinkedToCartItemId(int id, [FromQuery] DateTime? timeStamp, CancellationToken cancellationToken)
-        {
-            var productModifications = await _productModificationService.GetProductModificationsLinkedToCartItemId(id, timeStamp, cancellationToken);
-            return Ok(productModifications);
-        }
+        {}
 
         [HttpGet("product/{id}")]
killedBy: POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.GetModificationsLinkedToCartItemId_ValidCartItemId_ReturnsOkWithList

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ProductModificationController.cs:73:9
         [HttpGet("product/{id}")]
         [Authorize(Policy = "ItemRead")]
         public async Task<IActionResult> GetProductModificationsLinkedToProductId(int id, CancellationToken cancellationToken, [FromQuery] int pageSize = 10, [FromQuery] int pageNumber = 0)
-        {
-            var productModifications = await _productModificationService.GetProductModificationsLinkedToProductId(pageSize, pageNumber, id, cancellationToken);
-            return Ok(productModifications);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.ProductModificationControllerTests.GetModificationsLinkedToProductId_ValidProductId_ReturnsOkWithList
