[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceController.cs:17:5
     [HttpGet]
     [Authorize(Policy = "ServiceRead")]
     public async Task<IActionResult> GetAllServices(CancellationToken cancellationToken, int pageNum = 0, int pageSize = 10)
-    {
-        var services = await _serviceOfService.GetAllServicesAsync(cancellationToken, pageNum, pageSize);
-
-        return Ok(services);
-    }
+    {}
 
     [HttpGet("{id:int}")]
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceController.cs:26:5
     [HttpGet("{id:int}")]
     [Authorize(Policy = "ServiceRead")]
     public async Task<IActionResult> GetServiceById([FromRoute] int id, CancellationToken cancellationToken)
-    {
-        var result = await _serviceOfService.GetServiceByIdAsync(id, cancellationToken);
-
-        return Ok(result);
-    }
+    {}
 
     [HttpPost]
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.GetById_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.ServiceControllerTests.GetById_ExistingId_ReturnsOkWithService

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceController.cs:35:5
     [HttpPost]
     [Authorize(Policy = "ServiceWrite")]
     public async Task<IActionResult> CreateService([FromBody] ServiceRequest serviceRequest, CancellationToken cancellationToken)
-    {
-        var newservice = await _serviceOfService.CreateServiceAsync(serviceRequest, cancellationToken);
-        return Ok(newservice);
-    }
+    {}
 
     [HttpPut("{id:int}")]
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.Create_ValidRequest_ReturnsOkWithCreatedService; POS_System.Integration.Tests.Controllers.ServiceControllerTests.Update_ExistingId_ReturnsOkWithUpdatedService; POS_System.Integration.Tests.Controllers.ServiceControllerTests.Delete_ExistingId_ReturnsNoContentAndSoftDeletesService

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceController.cs:43:5
     [HttpPut("{id:int}")]
     [Authorize(Policy = "ServiceWrite")]
     public async Task<IActionResult> UpdateService([FromRoute] int id, [FromBody] ServiceRequest serviceRequest, CancellationToken cancellationToken)
-    {
-        var updatedservice = await _serviceOfService.UpdateServiceAsync(id, serviceRequest, cancellationToken);
-
-        return Ok(updatedservice);
-    }
+    {}
 
     [HttpDelete("{id:int}")]
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.Update_ExistingId_ReturnsOkWithUpdatedService; POS_System.Integration.Tests.Controllers.ServiceControllerTests.Update_NonExistentId_ReturnsNotFound

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceController.cs:53:9
     [Authorize(Policy = "ServiceWrite")]
     public async Task<IActionResult> DeleteService([FromRoute] int id, CancellationToken cancellationToken)
     {
-        await _serviceOfService.DeleteServiceAsync(id, cancellationToken);
+        ;
 
         return NoContent();
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.Delete_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.ServiceControllerTests.Delete_ExistingId_ReturnsNoContentAndSoftDeletesService

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceController.cs:62:5
     [HttpGet("tax/{id}")]
     [Authorize(Policy = "ItemRead")]
     public async Task<IActionResult> GetServicesLinkedToTaxId(int id, [FromQuery] DateTime? timeStamp, CancellationToken cancellationToken)
-    {
-        var services = await _serviceOfService.GetServicesLinkedToTaxId(id, timeStamp, cancellationToken);
-        return Ok(services);
-    }
+    {}
 
     //Leave timeStamp null if you want to get only the active items
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.GetServicesLinkedToTaxId_ValidTaxId_ReturnsOkWithList

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceController.cs:71:5
     [HttpGet("item-discount/{id}")]
     [Authorize(Policy = "ItemRead")]
     public async Task<IActionResult> GetServicesLinkedToItemDiscountId(int id, [FromQuery] DateTime? timeStamp, CancellationToken cancellationToken)
-    {
-        var services = await _serviceOfService.GetServicesLinkedToItemDiscountId(id, timeStamp, cancellationToken);
-        return Ok(services);
-    }
+    {}
 }
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.GetServicesLinkedToItemDiscountId_ValidId_ReturnsOkWithList
