[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceReservationController.cs:15:9
         [Authorize("ServiceRead")]
         [HttpGet]
         public async Task<IActionResult> GetAllServiceReservations(CancellationToken cancellationToken, [FromQuery] int pageSize = 10, [FromQuery] int pageNumber = 0)
-        {
-            var serviceReservations = await _serviceReservationService.GetServiceReservationsAsync(pageSize, pageNumber, cancellationToken);
-            return Ok(serviceReservations);
-        }
+        {}
 
         [Authorize("ServiceRead")]
killedBy: POS_System.Integration.Tests.Controllers.ServiceReservationControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceReservationController.cs:23:9
         [Authorize("ServiceRead")]
         [HttpGet("{id}")]
         public async Task<IActionResult> GetServiceReservationById(int id, CancellationToken cancellationToken)
-        {
-            var serviceReservation = await _serviceReservationService.GetServiceReservationByIdAsync(id, cancellationToken);
-            return Ok(serviceReservation);
-        }
+        {}
 
         [Authorize("ServiceWrite")]
killedBy: POS_System.Integration.Tests.Controllers.ServiceReservationControllerTests.GetById_ExistingId_ReturnsOkWithReservation; POS_System.Integration.Tests.Controllers.ServiceReservationControllerTests.GetById_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceReservationController.cs:31:9
         [Authorize("ServiceWrite")]
         [HttpPost]
         public async Task<IActionResult> CreateServiceReservation(ServiceReservationRequest? serviceReservationDto, CancellationToken cancellationToken)
-        {
-            var serviceReservation = await _serviceReservationService.CreateServiceReservationAsync(serviceReservationDto, cancellationToken);
-            return Ok(serviceReservation);
-        }
+        {}
 
         [Authorize("ServiceWrite")]
killedBy: POS_System.Integration.Tests.Controllers.ServiceReservationControllerTests.Create_ValidRequest_ReturnsOkWithCreatedReservation; POS_System.Integration.Tests.Controllers.ServiceReservationControllerTests.Update_ExistingId_ReturnsOkWithUpdatedReservation; POS_System.Integration.Tests.Controllers.ServiceReservationControllerTests.GetById_ExistingId_ReturnsOkWithReservation

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/ServiceReservationController.cs:39:9
         [Authorize("ServiceWrite")]
         [HttpPut("{id}")]
         public async Task<IActionResult> UpdateServiceReservation(int id, ServiceReservationRequest? serviceReservationDto, CancellationToken cancellationToken)
-        {
-            var serviceReservation = await _serviceReservationService.UpdateServiceReservationByIdAsync(id, serviceReservationDto, cancellationToken);
-            return Ok(serviceReservation);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.ServiceReservationControllerTests.Update_ExistingId_ReturnsOkWithUpdatedReservation; POS_System.Integration.Tests.Controllers.ServiceReservationControllerTests.Update_NonExistentId_ReturnsNotFound
