[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TaxController.cs:15:9
         [HttpGet]
         [Authorize("TaxRead")]
         public async Task<IActionResult> GetAllTaxes (CancellationToken cancellationToken, [FromQuery] int pageNum = 0, [FromQuery] int pageSize = 10)
-        {
-            var taxes = await _taxService.GetAllTaxesAsync(pageSize, pageNum, cancellationToken);
-            return Ok(taxes);
-        }
+        {}
 
         [HttpPost]
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TaxController.cs:23:9
         [HttpPost]
         [Authorize("TaxWrite")]
         public async Task<IActionResult> CreateTax([FromBody] TaxRequest taxDto, CancellationToken cancellationToken)
-        {
-            var createdTax = await _taxService.CreateTaxAsync(taxDto, cancellationToken);
-            return Ok(createdTax);
-        }
+        {}
 
         [HttpGet("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.Delete_ExistingId_ReturnsOkAndMarksTaxDeleted; POS_System.Integration.Tests.Controllers.TaxControllerTests.Update_ExistingId_ReturnsOkWithUpdatedTax; POS_System.Integration.Tests.Controllers.TaxControllerTests.Create_ValidRequest_ReturnsOkWithCreatedTax

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TaxController.cs:31:9
         [HttpGet("{id}")]
         [Authorize("TaxRead")]
         public async Task<IActionResult> GetTaxById(int id, CancellationToken cancellationToken)
-        {
-            var tax = await _taxService.GetTaxByIdAsync(id, cancellationToken);
-            return Ok(tax);
-        }
+        {}
 
         [HttpDelete("{id}")]
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.GetById_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.TaxControllerTests.GetById_ExistingId_ReturnsOkWithTax

[Killed] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TaxController.cs:40:13
         [Authorize("TaxWrite")]
         public async Task<IActionResult> DeleteTaxById(int id, CancellationToken cancellationToken)
         {
-            await _taxService.DeleteTaxAsync(id, cancellationToken);
+            ;
             return Ok();
         }
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.Delete_ExistingId_ReturnsOkAndMarksTaxDeleted; POS_System.Integration.Tests.Controllers.TaxControllerTests.Delete_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TaxController.cs:47:9
         [HttpPut("{id}")]
         [Authorize("TaxWrite")]
         public async Task<IActionResult> UpdateTaxById(int id, [FromBody] TaxRequest taxDto, CancellationToken cancellationToken)
-        {
-            var updatedTax = await _taxService.UpdateTaxAsync(id, taxDto, cancellationToken);
-            return Ok(updatedTax);
-        }
+        {}
 
         [HttpPut("{id}/link")]
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.Update_ExistingId_ReturnsOkWithUpdatedTax; POS_System.Integration.Tests.Controllers.TaxControllerTests.Update_NonExistentId_ReturnsNotFound

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TaxController.cs:56:13
         [Authorize("TaxWrite")]
         public async Task<IActionResult> LinkTaxToItems(int id, [FromQuery] bool itemsAreProducts, [FromBody] int[] itemIdList, CancellationToken cancellationToken)
         {
-            await _taxService.LinkTaxToItemsAsync(id, itemsAreProducts, itemIdList, cancellationToken);
+            ;
                 
             return Ok();

[Survived] Statement mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TaxController.cs:65:13
         [Authorize("TaxWrite")]
         public async Task<IActionResult> UnlinkTaxFromItems(int id, [FromQuery] bool itemsAreProducts, [FromBody] int[] itemIdList, CancellationToken cancellationToken)
         {
-            await _taxService.UnlinkTaxFromItemsAsync(id, itemsAreProducts, itemIdList, cancellationToken);
+            ;
             
             return Ok();

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TaxController.cs:74:9
         [HttpGet("item/{id}")]
         [Authorize("TaxRead")]
         public async Task<IActionResult> GetTaxesLinkedToItemId(int id, [FromQuery] bool isProduct, [FromQuery] DateTime? timeStamp, CancellationToken cancellationToken)
-        {
-            var taxes = await _taxService.GetTaxesLinkedToItemId(id, isProduct, timeStamp, cancellationToken);
-            return Ok(taxes);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.TaxControllerTests.GetTaxesLinkedToItemId_ValidProductId_ReturnsOkWithList
