[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TimeSlotController.cs:15:9
         [Authorize("ServiceRead")]
         [HttpGet]
         public async Task<IActionResult> GetAllTimeSlots([FromQuery] bool? onlyAvailable, CancellationToken cancellationToken, [FromQuery] int pageSize = 10, [FromQuery] int pageNumber = 0)
-        {
-            var timeSlots = await _timeSlotService.GetTimeSlotsAsync(pageSize, pageNumber, onlyAvailable, cancellationToken);
-            return Ok(timeSlots);
-        }
+        {}
 
         [Authorize("ServiceRead")]
killedBy: POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.GetAll_ValidToken_ReturnsOkWithPagedResult; POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.GetAll_FilterByOnlyAvailable_ReturnsOnlyAvailableSlots

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TimeSlotController.cs:23:9
         [Authorize("ServiceRead")]
         [HttpGet("{id}")]
         public async Task<IActionResult> GetTimeSlotById(int id, CancellationToken cancellationToken)
-        {
-            var timeSlot = await _timeSlotService.GetTimeSlotByIdAsync(id, cancellationToken);
-            return Ok(timeSlot);
-        }
+        {}
 
         [Authorize("ServiceWrite")]
killedBy: POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.GetById_ExistingId_ReturnsOkWithTimeSlot; POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.GetById_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TimeSlotController.cs:31:9
         [Authorize("ServiceWrite")]
         [HttpPost]
         public async Task<IActionResult> CreateTimeSlot(TimeSlotRequest? timeSlotDto, CancellationToken cancellationToken)
-        {
-            var timeSlot = await _timeSlotService.CreateTimeSlotAsync(timeSlotDto, cancellationToken);
-            return Ok(timeSlot);
-        }
+        {}
 
         [Authorize("ServiceWrite")]
killedBy: POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.Update_ExistingId_ReturnsOkWithUpdatedTimeSlot; POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.Create_ValidRequest_ReturnsOkWithCreatedTimeSlot; POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.Delete_ExistingId_ReturnsOkAndRemovesSlot

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TimeSlotController.cs:39:9
         [Authorize("ServiceWrite")]
         [HttpPut("{id}")]
         public async Task<IActionResult> UpdateTimeSlot(int id, TimeSlotRequest? timeSlotDto, CancellationToken cancellationToken)
-        {
-            var timeSlot = await _timeSlotService.UpdateTimeSlotAsync(id, timeSlotDto, cancellationToken);
-            return Ok(timeSlot);
-        }
+        {}
 
         [Authorize("ServiceWrite")]
killedBy: POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.Update_ExistingId_ReturnsOkWithUpdatedTimeSlot; POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.Update_NonExistentId_ReturnsNotFound

[Killed] Block removal mutation
BakalauruiPSP_project/POS-System.Api/Controllers/TimeSlotController.cs:47:9
         [Authorize("ServiceWrite")]
         [HttpDelete("{id}")]
         public async Task<IActionResult> DeleteTimeSlot(int id, CancellationToken cancellationToken)
-        {
-            var timeSlot = await _timeSlotService.DeleteTimeSlotAsync(id, cancellationToken);
-            return Ok(timeSlot);
-        }
+        {}
     }
 }
killedBy: POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.Delete_NonExistentId_ReturnsNotFound; POS_System.Integration.Tests.Controllers.TimeSlotControllerTests.Delete_ExistingId_ReturnsOkAndRemovesSlot
