[Killed] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:7:1
 
 var builder = WebApplication.CreateBuilder(args);
 
-builder
-    .ConfigureSwagger()
-    .ConfigureValidators()
-    .AddGlobalExceptionHandler();
+;
 
 builder.Services.AddAuthentication();
killedBy: POS_System.Integration.Tests.Controllers.ServiceControllerTests.GetById_NonExistentId_ReturnsNotFound

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:12:1
     .ConfigureValidators()
     .AddGlobalExceptionHandler();
 
-builder.Services.AddAuthentication();
+;
 builder.Services.AddApiServices(builder.Configuration); // configuration may be removed if not used
 builder.Services.AddBusinessServices(builder.Configuration); // configuration may be removed if not used

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:13:1
     .AddGlobalExceptionHandler();
 
 builder.Services.AddAuthentication();
-builder.Services.AddApiServices(builder.Configuration); // configuration may be removed if not used
+; // configuration may be removed if not used
 builder.Services.AddBusinessServices(builder.Configuration); // configuration may be removed if not used
 builder.Services.AddDataServices(builder.Configuration);

[Killed] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:14:1
 
 builder.Services.AddAuthentication();
 builder.Services.AddApiServices(builder.Configuration); // configuration may be removed if not used
-builder.Services.AddBusinessServices(builder.Configuration); // configuration may be removed if not used
+; // configuration may be removed if not used
 builder.Services.AddDataServices(builder.Configuration);
 builder.Services.AddControllers();
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Create_MissingToken_ReturnsUnauthorized; POS_System.Integration.Tests.Controllers.TaxControllerTests.Create_MissingToken_ReturnsUnauthorized

[Killed] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:15:1
 builder.Services.AddAuthentication();
 builder.Services.AddApiServices(builder.Configuration); // configuration may be removed if not used
 builder.Services.AddBusinessServices(builder.Configuration); // configuration may be removed if not used
-builder.Services.AddDataServices(builder.Configuration);
+;
 builder.Services.AddControllers();
 builder.Services.AddEndpointsApiExplorer();
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Create_MissingToken_ReturnsUnauthorized; POS_System.Integration.Tests.Controllers.TaxControllerTests.Create_MissingToken_ReturnsUnauthorized

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:16:1
 builder.Services.AddApiServices(builder.Configuration); // configuration may be removed if not used
 builder.Services.AddBusinessServices(builder.Configuration); // configuration may be removed if not used
 builder.Services.AddDataServices(builder.Configuration);
-builder.Services.AddControllers();
+;
 builder.Services.AddEndpointsApiExplorer();
 builder.Services.AddSwaggerGen();

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:17:1
 builder.Services.AddBusinessServices(builder.Configuration); // configuration may be removed if not used
 builder.Services.AddDataServices(builder.Configuration);
 builder.Services.AddControllers();
-builder.Services.AddEndpointsApiExplorer();
+;
 builder.Services.AddSwaggerGen();
 

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:18:1
 builder.Services.AddDataServices(builder.Configuration);
 builder.Services.AddControllers();
 builder.Services.AddEndpointsApiExplorer();
-builder.Services.AddSwaggerGen();
+;
 
 builder.WebHost.UseUrls("http://localhost:3000");

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:20:1
 builder.Services.AddEndpointsApiExplorer();
 builder.Services.AddSwaggerGen();
 
-builder.WebHost.UseUrls("http://localhost:3000");
+;
 
 builder.Services.AddCors(options =>

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:22:1
 
 builder.WebHost.UseUrls("http://localhost:3000");
 
-builder.Services.AddCors(options =>
-{
-    options.AddDefaultPolicy(policy =>
-    {
-        policy.AllowAnyOrigin();
-        policy.AllowAnyHeader();
-        policy.AllowAnyMethod();
-    });
-});
+;
 
 var app = builder.Build();

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:24:5
 
 builder.Services.AddCors(options =>
 {
-    options.AddDefaultPolicy(policy =>
-    {
-        policy.AllowAnyOrigin();
-        policy.AllowAnyHeader();
-        policy.AllowAnyMethod();
-    });
+    ;
 });
 

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:26:9
 {
     options.AddDefaultPolicy(policy =>
     {
-        policy.AllowAnyOrigin();
+        ;
         policy.AllowAnyHeader();
         policy.AllowAnyMethod();

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:27:9
     options.AddDefaultPolicy(policy =>
     {
         policy.AllowAnyOrigin();
-        policy.AllowAnyHeader();
+        ;
         policy.AllowAnyMethod();
     });

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:28:9
     {
         policy.AllowAnyOrigin();
         policy.AllowAnyHeader();
-        policy.AllowAnyMethod();
+        ;
     });
 });

[NoCoverage] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:37:5
 // Configure the HTTP request pipeline.
 if (app.Environment.IsDevelopment())
 {
-    app.UseSwagger();
+    ;
     app.UseSwaggerUI();
 }

[NoCoverage] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:38:5
 if (app.Environment.IsDevelopment())
 {
     app.UseSwagger();
-    app.UseSwaggerUI();
+    ;
 }
 

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:41:1
     app.UseSwaggerUI();
 }
 
-app.UseMiddleware<RequestLoggingMiddleware>();
+;
 
 app.UseExceptionHandler(new ExceptionHandlerOptions

[NoCoverage] Equality mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:49:13
     {
         var exception = context.Features.Get<IExceptionHandlerFeature>()?.Error;
 
-        if (exception != null)
+        if (exception == null)
         {
             var handler = context.RequestServices.GetRequiredService<GlobalExceptionHandler>();

[NoCoverage] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:52:13
         if (exception != null)
         {
             var handler = context.RequestServices.GetRequiredService<GlobalExceptionHandler>();
-            await handler.TryHandleAsync(context, exception, CancellationToken.None);
+            ;
         }
     }

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:57:1
     }
 });
 
-app.UseHttpsRedirection();
+;
 app.UseRouting();
 

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:58:1
 });
 
 app.UseHttpsRedirection();
-app.UseRouting();
+;
 
 app.UseCors();

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:60:1
 app.UseHttpsRedirection();
 app.UseRouting();
 
-app.UseCors();
+;
 
 app.UseAuthentication();

[Survived] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:62:1
 
 app.UseCors();
 
-app.UseAuthentication();
+;
 app.UseAuthorization();
 

[Killed] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:63:1
 app.UseCors();
 
 app.UseAuthentication();
-app.UseAuthorization();
+;
 
 app.MapControllers();
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Create_MissingToken_ReturnsUnauthorized; POS_System.Integration.Tests.Controllers.TaxControllerTests.Create_MissingToken_ReturnsUnauthorized

[Killed] Statement mutation
Desktop/BakalauruiPSP_project/POS-System.Api/Program.cs:65:1
 app.UseAuthentication();
 app.UseAuthorization();
 
-app.MapControllers();
+;
 
 app.Run();
killedBy: POS_System.Integration.Tests.Controllers.GiftCardControllerTests.Create_MissingToken_ReturnsUnauthorized; POS_System.Integration.Tests.Controllers.TaxControllerTests.Create_MissingToken_ReturnsUnauthorized
